ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/include/Reg_eSys_MagicCarpet.h
/**
*   @file    Reg_eSys_MagicCarpet.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Mcu - Defines used to access the MC registers.
*   @details This file contains the defines used by the driver to access the MC registers.
*
*   @addtogroup MCU
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : MC
*   Dependencies         : none
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC560xB_MCAL_1_0_1_RTM_HF13_ASR_REL_4_0_REV_0003_20170719
*
*   (c) Copyright 2006-2016 Freescale Semiconductor Inc and STMicroelectronics
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_MAGICCARPET_H
#define Reg_ESYS_MAGICCARPET_H

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Reg_eSys_MagicCarpet_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section Reg_eSys_MagicCarpet_h_REF_2
* Violates MISRA 2004 Required Rule 19.15, Repeated include files, Precautions shall be taken in
* order to prevent the contents of a header file being included twice This is not a violation since
* all header files are protected against multiple inclusions
*
* @section Reg_eSys_MagicCarpet_h_REF_3
* Violates MISRA 2004 Required Rule 19.10, In the definition of a function-like macro each instance of a
* parameter shall be enclosed in parentheses unless it is used as the operand of # or ##.
* This is for better readablity.
*
* @section Reg_eSys_MagicCarpet_h_REF_4
* Violates MISRA 2004 Required Rule 20.2, The names of standard library macros, objects and
* functions shall not be reused. Symbol required to be defined when one compiler is used.
* Requested by AutoSAR (Req. COMPILER010).
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_2 MISRA 2004 Required Rule 19.15, Repeated include file
*/
#include "Reg_eSys.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/

/**************************** MC_CGM Memory Map ******************************/

#define MC_CGM_XOSC_CTL_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0000UL))
#define MC_CGM_OSC_CTL_R                    ((uint32)(MC_CGM_BASEADDR+ (uint32)0x0040UL))
#define MC_CGM_RC_CTL_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x0060UL))
#define MC_CGM_RC_CTL_R_L                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0062UL))
#define MC_CGM_LPRC_CTL_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0080UL))
#define MC_CGM_LPRC_CTL_R_L                 ((uint32)(MC_CGM_BASEADDR+(uint32)0x0082UL))
#define MC_CGM_PLL0_CR_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x00A0UL))
#define MC_CGM_PLL0_MR_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x00A4UL))

#define MC_CGM_PLL1_CR_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x00C0UL))
#define MC_CGM_PLL1_MR_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x00C4UL))

#define MC_CGM_CMU0_CSR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0100UL))
#define MC_CGM_CMU0_FDR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0104UL))
#define MC_CGM_CMU0_HFREFR_R                ((uint32)(MC_CGM_BASEADDR+(uint32)0x0108UL))
#define MC_CGM_CMU0_LFREFR_R                ((uint32)(MC_CGM_BASEADDR+(uint32)0x010CUL))
#define MC_CGM_CMU0_ISR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0110UL))
#define MC_CGM_CMU0_IMR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0114UL))
#define MC_CGM_CMU0_MDR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0118UL))

#define MC_CGM_CMU1_CSR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0120UL))
#define MC_CGM_CMU1_FDR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0124UL))
#define MC_CGM_CMU1_HFREFR_R                ((uint32)(MC_CGM_BASEADDR+(uint32)0x0128UL))
#define MC_CGM_CMU1_LFREFR_R                ((uint32)(MC_CGM_BASEADDR+(uint32)0x012CUL))
#define MC_CGM_CMU1_ISR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0130UL))
#define MC_CGM_CMU1_IMR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0134UL))
#define MC_CGM_CMU1_MDR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0138UL))
#define MC_CGM_CMU2_CSR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0140UL))
#define MC_CGM_CMU2_FDR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0144UL))
#define MC_CGM_CMU2_HFREFR_R                ((uint32)(MC_CGM_BASEADDR+(uint32)0x0148UL))
#define MC_CGM_CMU2_LFREFR_R                ((uint32)(MC_CGM_BASEADDR+(uint32)0x014CUL))
#define MC_CGM_CMU2_ISR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0150UL))
#define MC_CGM_CMU2_IMR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0154UL))
#define MC_CGM_CMU2_MDR_R                   ((uint32)(MC_CGM_BASEADDR+(uint32)0x0158UL))

#define MC_CGM_OC_EN_R                      ((uint32)(MC_CGM_BASEADDR+(uint32)0x0370UL))
#define MC_CGM_OCDS_SC_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x0374UL))

#define MC_CGM_SC_SS_R                      ((uint32)(MC_CGM_BASEADDR+(uint32)0x0378UL))

#define MC_CGM_Z0_DCR_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x00C0UL))
#define MC_CGM_FEC_DCR_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x00E0UL))
#define MC_CGM_FLASH_DCR_R                  ((uint32)(MC_CGM_BASEADDR+(uint32)0x0120UL))

#define MC_CGM_SC_DC0_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x037CUL))
#define MC_CGM_SC_DC1_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x037DUL))
#define MC_CGM_SC_DC2_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x037EUL))

#define MC_CGM_AC0_SC_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x0380UL))
#define MC_CGM_AC0_DC0_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x0384UL))
#define MC_CGM_AC0_DC1_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x0385UL))

#define MC_CGM_AC1_SC_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x0388UL))
#define MC_CGM_AC1_DC0_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x038CUL))

#define MC_CGM_AC2_SC_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x0390UL))
#define MC_CGM_AC2_DC0_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x0394UL))

#define MC_CGM_AC3_SC_R                     ((uint32)(MC_CGM_BASEADDR+(uint32)0x0398UL))
#define MC_CGM_AC3_DC0_R                    ((uint32)(MC_CGM_BASEADDR+(uint32)0x039CUL))

