ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/include/Reg_eSys_MagicCarpet.h
#define CMU1_PLL_MONITOR_MASK              ((((uint32)0x1))<<0)

#define PLL1_CMU_RESETVALUE                (0x0UL)

/******************************************************************************/
/*                                                      CMU_1_HF                                                                                                     */
/******************************************************************************/
/* High Frequency register */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define CMU1_HFREF(x)                      ((uint32)(((uint32)x)<<0))
#define CMU1_HFREF_MASK                    ((uint32)(((uint32)0xFFFUL)<<0))

/******************************************************************************/
/*                                                      CMU_1_LF                                                                                                     */
/******************************************************************************/
/* Low Frequency register */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define CMU1_LFREF(x)                      ((uint32)(((uint32)x)<<0))
#define CMU1_LFREF_MASK                    ((uint32)(((uint32)0xFFFUL)<<0))

/******************************************************************************/
/*                                                      CMU_1_ISR                                                                                                     */
/******************************************************************************/
/* FLCI field */
#define CMU1_ISR_FLCI                      ((((uint32)0x1))<<3)
/* FHHI field */
#define CMU1_ISR_FHHI                      ((((uint32)0x1))<<2)
/* FLLI field */
#define CMU1_ISR_FLLI                      ((((uint32)0x1))<<1)

/*******************************************************************************/
/*                                                     MC_CGM_CMUx                                                                                                    */
/*******************************************************************************/
#define MC_CGM_CMU0                         (0x00U)
#define MC_CGM_CMU1                         (0x01U)
#define MC_CGM_CMU2                         (0x02U)
#define MC_CGM_CMU3                         (0x03U)
#define MC_CGM_CMU4                         (0x04U)
#define MC_CGM_CMU5                         (0x05U)
#define MC_CGM_CMU6                         (0x06U)
#define MC_CGM_CMU7                         (0x07U)
#define MC_CGM_CMU8                         (0x08U)
#define MC_CGM_CMU9                         (0x09U)
#define MC_CGM_CMU10                        (0x0AU)
#define MC_CGM_CMU11                        (0x0BU)
#define MC_CGM_CMU12                        (0x0CU)

#define MC_CGM_CMU_CME_BIT                  ((uint32)0x00000001UL)

/******************************************************************************/
/*                                                      ME_GS                                                                                                              */
/******************************************************************************/
/* Current Mode field */
#define ME_GS_CURRENT_MODE                 ((uint32)(((uint32)0xF)<<28))

#define ME_GS_CURRENT_MODE_RESET           ((uint32)(((uint32)0)<<28))
#define ME_GS_CURRENT_MODE_TEST            ((uint32)(((uint32)1)<<28))
#define ME_GS_CURRENT_MODE_SAFE            ((uint32)(((uint32)2)<<28))
#define ME_GS_CURRENT_MODE_DRUN            ((uint32)(((uint32)3)<<28))
#define ME_GS_CURRENT_MODE_RUN0            ((uint32)(((uint32)4)<<28))
#define ME_GS_CURRENT_MODE_RUN1            ((uint32)(((uint32)5)<<28))
#define ME_GS_CURRENT_MODE_RUN2            ((uint32)(((uint32)6)<<28))
#define ME_GS_CURRENT_MODE_RUN3            ((uint32)(((uint32)7)<<28))
#define ME_GS_CURRENT_MODE_HALT            ((uint32)(((uint32)8)<<28))
#define ME_GS_CURRENT_MODE_STOP            ((uint32)(((uint32)10)<<28))

/* MTRANS field */
#define ME_GS_MODE_TRANSITION              ((((uint32)0x1))<<27)

/* DC field */
#define ME_GS_DEV_CONSUMPTION              ((((uint32)0x1))<<26)

/* PDO field */
#define ME_GS_POWER_DOWN_OUT               ((((uint32)0x1))<<23)

/* MVR field */
#define ME_GS_VOLTAGE_REG                  ((((uint32)0x1))<<20)

/* DFL field*/
#define ME_GS_DATA_FLASH                   ((uint32)(((uint32)0x3)<<18))

/* CFL field*/
#define ME_GS_CODE_FLASH                   ((uint32)(((uint32)0x3)<<16))

/* PLL1 field*/
#define ME_GS_PLL1_STATUS                  ((((uint32)0x1))<<7)

/* PLL0 field*/
#define ME_GS_PLL0_STATUS                  ((((uint32)0x1))<<6)

/* XOSC field */
#define ME_GS_XOSC_STATUS                  ((((uint32)0x1))<<5)

/* RC field */
#define ME_GS_RC_STATUS                    ((((uint32)0x1))<<4)

/* SYSCLOCK field */
#define ME_GS_SYSCLK_STATUS                ((uint32)(((uint32)0xF)<<0))

/******************************************************************************/
/*                                                      ME_MCTL                                                                                                       */
/******************************************************************************/
/* Target Mode field */
/* @violates @ref Reg_eSys_MagicCarpet_h_REF_1 Violates MISRA 2004 Advisory
                   Rule 19.7, Function-like macro defined                   */
/*
* @violates @ref Reg_eSys_MagicCarpet_h_REF_3 In the definition of a function-like macro each instance of a
*  parameter shall be enclosed in parentheses
*/
#define ME_MCTL_TARGET_MODE(x)             ((uint32)(((uint32)x)<<28))
#define ME_TARGET_MODE_MASK                ((uint32)(((uint32)0xF)<<28))

#define ME_TARGET_MODE_RESET               0x0U
#define ME_TARGET_MODE_TEST                0x1U
#define ME_TARGET_MODE_SAFE                0x2U
#define ME_TARGET_MODE_DRUN                0x3U
#define ME_TARGET_MODE_RUN0                0x4U
#define ME_TARGET_MODE_RUN1                0x5U
#define ME_TARGET_MODE_RUN2                0x6U
#define ME_TARGET_MODE_RUN3                0x7U
#define ME_TARGET_MODE_HALT                0x8U
#define ME_TARGET_MODE_STOP                0xAU

/* Key field */
#define ME_MCTL_DIRECT_KEY                 ((uint32)(((uint32)0x5AF0UL)<<0))
#define ME_MCTL_INVERTED_KEY               ((uint32)(((uint32)0xA50FUL)<<0))

