ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/include/Reg_eSys_MagicCarpet.h
/*******************************************************************************/
/*                                                     RGM_FERD                                                                                                        */
/*******************************************************************************/
/* JTAG field */
#define FERD_JTAG_NORESET                 ((uint16)(((uint16)1)<<0))
#define FERD_JTAG_RESET                   ((uint16)(((uint16)0)<<0))
/* CORE field */
#define FERD_CORE_NORESET                 ((uint16)(((uint16)1)<<1))
#define FERD_CORE_RESET                   ((uint16)(((uint16)0)<<1))
/* SOFT field */
#define FERD_SOFT_NORESET                 ((uint16)(((uint16)1)<<2))
#define FERD_SOFT_RESET                   ((uint16)(((uint16)0)<<2))
/* CWD field */
#define FERD_CWD_NORESET                  ((uint16)(((uint16)1)<<3))
#define FERD_CWD_RESET                    ((uint16)(((uint16)0)<<3))
/* CHKSTOP field */
#define FERD_CHKSTOP_NORESET              ((uint16)(((uint16)0)<<3))
#define FERD_CHKSTOP_RESET                ((uint16)(((uint16)0)<<3))
/* PLL0 field */
#define FERD_PLL0_NORESET                 ((uint16)(((uint16)1)<<4))
#define FERD_PLL0_RESET                   ((uint16)(((uint16)0)<<4))
/* CMU0_OLR field */
#define FERD_CMU0_OLR_NORESET             ((uint16)(((uint16)1)<<5))
#define FERD_CMU0_OLR_RESET               ((uint16)(((uint16)0)<<5))
/* CMU0_FHL field */
#define FERD_CMU0_FHL_NORESET             ((uint16)(((uint16)1)<<6))
#define FERD_CMU0_FHL_RESET               ((uint16)(((uint16)0)<<6))
/* LVD45 field */
#define FERD_LVD45_NORESET                ((uint16)(((uint16)1)<<7))
#define FERD_LVD45_RESET                  ((uint16)(((uint16)0)<<7))
/* FCCU_SAFE field */
#define FERD_FCCU_SAFE_NORESET            ((uint16)(((uint16)1)<<7))
#define FERD_FCCU_SAFE_RESET              ((uint16)(((uint16)0)<<7))
/* SWT field */
#define FERD_SWT_NORESET                  ((uint16)(((uint16)0)<<8))
#define FERD_SWT_RESET                    ((uint16)(((uint16)0)<<8))
/* FLASH field */
#define FERD_FLASH_NORESET                ((uint16)(((uint16)1)<<8))
#define FERD_FLASH_RESET                  ((uint16)(((uint16)0)<<8))
/* PLL1 filed*/
#define FERD_PLL1_NORESET                 ((uint16)(((uint16)1)<<9))
#define FERD_PLL1_RESET                   ((uint16)(((uint16)0)<<9))
/* FL_ECC_RCC field  */
#define FERD_FL_ECC_RCC_NORESET           ((uint16)(((uint16)1)<<10))
#define FERD_FL_ECC_RCC_RESET             ((uint16)(((uint16)0)<<10))
/* Z4_CORE filed*/
#define FERD_Z4CORE_NORESET               ((uint16)(((uint16)1)<<10))
#define FERD_Z4CORE_RESET                 ((uint16)(((uint16)0)<<10))
/* CMU12_FHL field  */
#define FERD_CMU12_FHL_NORESET            ((uint16)(((uint16)1)<<11))
#define FERD_CMU12_FHL_RESET              ((uint16)(((uint16)0)<<11))
/* ST_DONE field  */
#define FERD_ST_DONE_NORESET              ((uint16)(((uint16)1)<<12))
#define FERD_ST_DONE_RESET                ((uint16)(((uint16)0)<<12))
/* FCCU_SOFT field  */
#define FERD_FCCU_SOFT_NORESET            ((uint16)(((uint16)1)<<13))
#define FERD_FCCU_SOFT_RESET              ((uint16)(((uint16)0)<<13))
/* ST_CF field  */
#define FERD_ST_CF_NORESET                ((uint16)(((uint16)1)<<13))
#define FERD_ST_CF_RESET                  ((uint16)(((uint16)1)<<13))
/* FCCU_HARD field  */
#define FERD_FCCU_HARD_NORESET            ((uint16)(((uint16)1)<<14))
#define FERD_FCCU_HARD_RESET              ((uint16)(((uint16)0)<<14))
/* ST_NCF field  */
#define FERD_ST_NCF_NORESET               ((uint16)(((uint16)1)<<14))
#define FERD_ST_NCF_RESET                 ((uint16)(((uint16)1)<<14))
/* F_EXR field */
#define FERD_EXR_NORESET                  ((uint16)(((uint16)1)<<15))
#define FERD_EXR_RESET                    ((uint16)(((uint16)0)<<15))

/*******************************************************************************/
/*                                                     RGM_DERD                                                                                                          */
/*******************************************************************************/
/* LVD12 field */
#define  DERD_LVD12_NORESET               ((uint16)(((uint16)1)<<0))
#define  DERD_LVD12_RESET                 ((uint16)(((uint16)0)<<0))
/* HVD12 field */
#define  DERD_HVD12_NORESET               ((uint16)(((uint16)1)<<1))
#define  DERD_HVD12_RESET                 ((uint16)(((uint16)0)<<1))
/* LVD27_VREG field */
#define DERD_LVD27_VREG_NORESET           ((uint16)(((uint16)1)<<4))
#define DERD_LVD27_VREG_RESET             ((uint16)(((uint16)0)<<4))
/* LVD27_FLASH field */
#define DERD_LVD27_FLASH_NORESET          ((uint16)(((uint16)1)<<5))
#define DERD_LVD27_FLASH_RESET            ((uint16)(((uint16)0)<<5))
/* LVD27_IO field */
#define DERD_LVD27_IO_NORESET             ((uint16)(((uint16)1)<<6))
#define DERD_LVD27_IO_RESET               ((uint16)(((uint16)0)<<6))
/* COMP field */
#define DERD_COMP_NORESET                 ((uint16)(((uint16)1)<<7))
#define DERD_COMP_RESET                   ((uint16)(((uint16)0)<<7))

/* COMP field */
#define DERD_SOFT_DEST_NORESET            ((uint16)(((uint16)1)<<14))
#define DERD_SOFT_DEST_RESET              ((uint16)(((uint16)0)<<14))

/* POR field */
#define DERD_POR_NORESET                  ((uint16)(((uint16)1)<<15))
#define DERD_POR_RESET                    ((uint16)(((uint16)0)<<15))
/*******************************************************************************/
/*                                                     RGM_FEAR                                                                                                        */
/*******************************************************************************/
/* JTAG field */
#define FEAR_JTAG_ISR                     ((uint16)(((uint16)1)<<0))
#define FEAR_JTAG_SAFE                    ((uint16)(((uint16)0)<<0))
/* CORE field */
#define FEAR_CORE_ISR                     ((uint16)(((uint16)1)<<1))
#define FEAR_CORE_SAFE                    ((uint16)(((uint16)0)<<1))
/* SOFT field */
#define FEAR_SOFT_ISR                     ((uint16)(((uint16)1)<<2))
#define FEAR_SOFT_SAFE                    ((uint16)(((uint16)0)<<2))
/* CWD field */
#define FEAR_CWD_ISR                      ((uint16)(((uint16)1)<<3))
#define FEAR_CWD_SAFE                     ((uint16)(((uint16)0)<<3))
/* CHKSTOP field */
#define FEAR_CHKSTOP_ISR                  ((uint16)(((uint16)1)<<3))
#define FEAR_CHKSTOP_SAFE                 ((uint16)(((uint16)0)<<3))
/* PLL0 field */
#define FEAR_PLL0_ISR                     ((uint16)(((uint16)1)<<4))
#define FEAR_PLL0_SAFE                    ((uint16)(((uint16)0)<<4))
/* CMU0_OLR field */
#define FEAR_CMU0_OLR_ISR                 ((uint16)(((uint16)1)<<5))
#define FEAR_CMU0_OLR_SAFE                ((uint16)(((uint16)0)<<5))
/* CMU0_FHL field */
#define FEAR_CMU0_FHL_ISR                 ((uint16)(((uint16)1)<<6))
#define FEAR_CMU0_FHL_SAFE                ((uint16)(((uint16)0)<<6))
/* LVD45 field */
#define FEAR_LVD45_ISR                    ((uint16)(((uint16)1)<<7))
#define FEAR_LVD45_SAFE                   ((uint16)(((uint16)0)<<7))
/* FCCU_SAFE field */
#define FEAR_FCCU_SAFE_ISR                ((uint16)(((uint16)1)<<7))
#define FEAR_FCCU_SAFE_SAFE               ((uint16)(((uint16)0)<<7))
/* FLASH field */
#define FEAR_FLASH_ISR                    ((uint16)(((uint16)1)<<8))
#define FEAR_FLASH_SAFE                   ((uint16)(((uint16)0)<<8))
/* SWT field */
#define FEAR_SWT_ISR                      ((uint16)(((uint16)1)<<8))
#define FEAR_SWT_SAFE                     ((uint16)(((uint16)0)<<8))
/* PLL1 field */
#define FEAR_PLL1_ISR                     ((uint16)(((uint16)1)<<9))
#define FEAR_PLL1_SAFE                    ((uint16)(((uint16)0)<<9))
/* Z4_CORE field */
#define FEAR_Z4CORE_ISR                   ((uint16)(((uint16)1)<<10))
#define FEAR_Z4CORE_SAFE                  ((uint16)(((uint16)0)<<10))
/* FL_ECC_RCC field */
#define FEAR_FL_ECC_RCC_ISR               ((uint16)(((uint16)1)<<10))
#define FEAR_FL_ECC_RCC_SAFE              ((uint16)(((uint16)0)<<10))
/* CMU12_FHL field */
#define FEAR_CMU12_FHL_ISR                ((uint16)(((uint16)1)<<11))
#define FEAR_CMU12_FHL_SAFE               ((uint16)(((uint16)0)<<11))
/* ST_DONE field */
#define FEAR_ST_DONE_ISR                  ((uint16)(((uint16)1)<<12))
#define FEAR_ST_DONE_SAFE                 ((uint16)(((uint16)0)<<12))
/* FCCU_SOFT field */
#define FEAR_FCCU_SOFT_ISR                ((uint16)(((uint16)1)<<13))
#define FEAR_FCCU_SOFT_SAFE               ((uint16)(((uint16)0)<<13))
/* FCCU_HARD field */
#define FEAR_FCCU_HARD_ISR                ((uint16)(((uint16)1)<<14))
#define FEAR_FCCU_HARD_SAFE               ((uint16)(((uint16)0)<<14))
/* EXR field */
#define FEAR_EXR_ISR                      ((uint16)(((uint16)1)<<15))
#define FEAR_EXR_SAFE                     ((uint16)(((uint16)0)<<15))

