ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/include/Reg_eSys_MagicCarpet.h
/*******************************************************************************/
/*                                                     RGM_FESS                                                                                                        */
/*******************************************************************************/
/* JTAG field */
#define FESS_JTAG_PH3                     ((uint16)(((uint16)1)<<0))
#define FESS_JTAG_PH1                     ((uint16)(((uint16)0)<<0))
/* CORE field */
#define FESS_CORE_PH3                     ((uint16)(((uint16)1)<<1))
#define FESS_CORE_PH1                     ((uint16)(((uint16)0)<<1))
/* SOFT field */
#define FESS_SOFT_PH3                     ((uint16)(((uint16)1)<<2))
#define FESS_SOFT_PH1                     ((uint16)(((uint16)0)<<2))
/* CWD field */
#define FESS_CWD_PH3                      ((uint16)(((uint16)1)<<3))
#define FESS_CWD_PH1                      ((uint16)(((uint16)0)<<3))
/* CHKSTOP field */
#define FESS_CHKSTOP_PH3                  ((uint16)(((uint16)1)<<3))
#define FESS_CHKSTOP_PH1                  ((uint16)(((uint16)0)<<3))
/* PLL0 field */
#define FESS_PLL0_PH3                     ((uint16)(((uint16)1)<<4))
#define FESS_PLL0_PH1                     ((uint16)(((uint16)0)<<4))
/* CMU0_OLR field */
#define FESS_CMU0_OLR_PH3                 ((uint16)(((uint16)1)<<5))
#define FESS_CMU0_OLR_PH1                 ((uint16)(((uint16)0)<<5))
/* CMU0_FHL field */
#define FESS_CMU0_FHL_PH3                 ((uint16)(((uint16)1)<<6))
#define FESS_CMU0_FHL_PH1                 ((uint16)(((uint16)0)<<6))
/* FCCU_SAFE field */
#define FESS_FCCU_SAFE_PH3                ((uint16)(((uint16)1)<<7))
#define FESS_FCCU_SAFE_PH1                ((uint16)(((uint16)0)<<7))
/* LVD45 field */
#define FESS_LVD45_PH3                    ((uint16)(((uint16)1)<<7))
#define FESS_LVD45_PH1                    ((uint16)(((uint16)0)<<7))
/* FLASH field */
#define FESS_FLASH_PH3                    ((uint16)(((uint16)1)<<8))
#define FESS_FLASH_PH1                    ((uint16)(((uint16)0)<<8))
/* SWT field */
#define FESS_SWT_PH3                      ((uint16)(((uint16)1)<<8))
#define FESS_SWT_PH1                      ((uint16)(((uint16)0)<<8))
/* PLL1 field */
#define FESS_PLL1_PH3                     ((uint16)(((uint16)1)<<9))
#define FESS_PLL1_PH1                     ((uint16)(((uint16)0)<<9))
/* FL_ECC_RCC field */
#define FESS_FL_ECC_RCC_PH3               ((uint16)(((uint16)1)<<10))
#define FESS_FL_ECC_RCC_PH1               ((uint16)(((uint16)0)<<10))
/* Z4_CORE field */
#define FESS_Z4CORE_PH3                   ((uint16)(((uint16)1)<<10))
#define FESS_Z4CORE_PH1                   ((uint16)(((uint16)0)<<10))
/* CMU12_FHL field */
#define FESS_CMU12_FHL_PH3                ((uint16)(((uint16)1)<<11))
#define FESS_CMU12_FHL_PH1                ((uint16)(((uint16)0)<<11))
/* ST_DONE field */
#define FESS_ST_DONE_PH3                  ((uint16)(((uint16)1)<<12))
#define FESS_ST_DONE_PH1                  ((uint16)(((uint16)0)<<12))
/* FCCU_SOFT field */
#define FESS_FCCU_SOFT_PH3                ((uint16)(((uint16)1)<<13))
#define FESS_FCCU_SOFT_PH1                ((uint16)(((uint16)0)<<13))
/* FCCU_HARD field */
#define FESS_FCCU_HARD_PH3                ((uint16)(((uint16)1)<<14))
#define FESS_FCCU_HARD_PH1                ((uint16)(((uint16)0)<<14))
/* EXR field */
#define FESS_EXR_PH3                      ((uint16)(((uint16)1)<<15))
#define FESS_EXR_PH1                      ((uint16)(((uint16)0)<<15))
/*******************************************************************************/
/*                                                     RGM_FBRE                                                                                                        */
/*******************************************************************************/
/* JTAG field */
#define FBRE_JTAG_DIS                     ((uint16)(((uint16)1)<<0))
#define FBRE_JTAG_EN                      ((uint16)(((uint16)0)<<0))
/* CORE field */
#define FBRE_CORE_DIS                     ((uint16)(((uint16)1)<<1))
#define FBRE_CORE_EN                      ((uint16)(((uint16)0)<<1))
/* SOFT field */
#define FBRE_SOFT_DIS                     ((uint16)(((uint16)1)<<2))
#define FBRE_SOFT_EN                      ((uint16)(((uint16)0)<<2))
/* CWD field */
#define FBRE_CWD_DIS                      ((uint16)(((uint16)1)<<3))
#define FBRE_CWD_EN                       ((uint16)(((uint16)0)<<3))
/* CHKSTOP field */
#define FBRE_CHKSTOP_DIS                  ((uint16)(((uint16)1)<<3))
#define FBRE_CHKSTOP_EN                   ((uint16)(((uint16)0)<<3))
/* PLL0 field */
#define FBRE_PLL0_DIS                     ((uint16)(((uint16)1)<<4))
#define FBRE_PLL0_EN                      ((uint16)(((uint16)0)<<4))
/* CMU0_OLR field */
#define FBRE_CMU0_OLR_DIS                 ((uint16)(((uint16)1)<<5))
#define FBRE_CMU0_OLR_EN                  ((uint16)(((uint16)0)<<5))
/* CMU0_FHL field */
#define FBRE_CMU0_FHL_DIS                 ((uint16)(((uint16)1)<<6))
#define FBRE_CMU0_FHL_EN                  ((uint16)(((uint16)0)<<6))
/* FCCU_SAFE field */
#define FBRE_FCCU_SAFE_DIS                ((uint16)(((uint16)1)<<7))
#define FBRE_FCCU_SAFE_EN                 ((uint16)(((uint16)0)<<7))
/* LVD45 field */
#define FBRE_LVD45_DIS                    ((uint16)(((uint16)1)<<7))
#define FBRE_LVD45_EN                     ((uint16)(((uint16)0)<<7))
/* SWT field */
#define FBRE_SWT_DIS                      ((uint16)(((uint16)1)<<8))
#define FBRE_SWT_EN                       ((uint16)(((uint16)0)<<8))
/* FLASH field */
#define FBRE_FLASH_DIS                    ((uint16)(((uint16)1)<<8))
#define FBRE_FLASH_EN                     ((uint16)(((uint16)0)<<8))
/* PLL1 field */
#define FBRE_PLL1_DIS                     ((uint16)(((uint16)1)<<9))
#define FBRE_PLL1_EN                      ((uint16)(((uint16)0)<<9))
/* FL_ECC_RCC field */
#define FBRE_FL_ECC_RCC_DIS               ((uint16)(((uint16)1)<<10))
#define FBRE_FL_ECC_RCC_EN                ((uint16)(((uint16)0)<<10))
/* Z4CORE field */
#define FBRE_Z4CORE_DIS                   ((uint16)(((uint16)1)<<10))
#define FBRE_Z4CORE_EN                    ((uint16)(((uint16)0)<<10))
/* CMU12_FHL field */
#define FBRE_CMU12_FHL_DIS                ((uint16)(((uint16)1)<<11))
#define FBRE_CMU12_FHL_EN                 ((uint16)(((uint16)0)<<11))
/* ST_DONE field */
#define FBRE_ST_DONE_DIS                  ((uint16)(((uint16)1)<<12))
#define FBRE_ST_DONE_EN                   ((uint16)(((uint16)0)<<12))
/* FCCU_SOFT field */
#define FBRE_FCCU_SOFT_DIS                ((uint16)(((uint16)1)<<13))
#define FBRE_FCCU_SOFT_EN                 ((uint16)(((uint16)0)<<13))
/* FCCU_HARD field */
#define FBRE_FCCU_HARD_DIS                ((uint16)(((uint16)1)<<14))
#define FBRE_FCCU_HARD_EN                 ((uint16)(((uint16)0)<<14))
/* EXR field */
#define FBRE_EXR_DIS                      ((uint16)(((uint16)1)<<15))
#define FBRE_EXR_EN                       ((uint16)(((uint16)0)<<15))

#define FBRE_POR_VALUE                    (0x0UL)    /*Power On Reset Value */


