ace-knu/autosar/mpc5606b/exercises/backup_Base/Generated/Mcal_Output/include/Reg_eSys_MagicCarpet.h
/*******************************************************************************/
/*                                                     RGM_DEAR                                                                                                          */
/*******************************************************************************/
/* LVD12_PD0 field */
#define  DEAR_LVD12_PD0_ISR               ((uint16)(((uint16)1)<<0))
#define  DEAR_LVD12_PD0_SAFE              ((uint16)(((uint16)0)<<0))
/* LVD12_PD1 field */
#define  DEAR_LVD12_PD1_ISR               ((uint16)(((uint16)1)<<1))
#define  DEAR_LVD12_PD1_SAFE              ((uint16)(((uint16)0)<<1))
/* SWT field */
#define DEAR_SWT_ISR                      ((uint16)(((uint16)1)<<2))
#define DEAR_SWT_SAFE                     ((uint16)(((uint16)0)<<2))
/* LVD27 field */
#define DEAR_LVD27_ISR                    ((uint16)(((uint16)1)<<3))
#define DEAR_LVD27_SAFE                   ((uint16)(((uint16)0)<<3))

#define MCU_RGM_DES_REG_MASK              ((uint16)0xFFFFU)
#define MCU_RGM_FES_REG_MASK              ((uint16)0xFFFFU)
#define MCU_MASK_EXT_RESET                ((uint32)0x80000000UL)
#define MCU_MASK_FLASH_RESET              ((uint32)0x01000000UL)
#define MCU_MASK_LVD45_RESET              ((uint32)0x00800000UL)
#define MCU_MASK_CMU0_FHL_RESET           ((uint32)0x00400000UL)
#define MCU_MASK_CMU0_OLR_RESET           ((uint32)0x00200000UL)
#define MCU_MASK_PLL0_RESET               ((uint32)0x00100000UL)
#define MCU_MASK_CHECKSTOP_RESET          ((uint32)0x00080000UL)
#define MCU_MASK_SOFT_RESET               ((uint32)0x00040000UL)
#define MCU_MASK_CORE_RESET               ((uint32)0x00020000UL)
#define MCU_MASK_JTAG_RESET               ((uint32)0x00010000UL)
#define MCU_MASK_POR_RESET                ((uint32)0x00008000UL)
#define MCU_MASK_LVD27_VREG_RESET         ((uint32)0x00000010UL)  /* Flag for 2.7 V low-voltage det. (VREG) */
#define MCU_MASK_LVD27_RESET              ((uint32)0x00000008UL)
#define MCU_MASK_SWT_D_RESET              ((uint32)0x00000004UL)
#define MCU_MASK_LVD12_PD1_RESET          ((uint32)0x00000002UL)
#define MCU_MASK_LVD12_PD0_RESET          ((uint32)0x00000001UL)
#define MCU_MASK_COMP_RESET               ((uint32)0x00000080UL)


/*==================================================================================================
                                       DEFINES AND MACROS
==================================================================================================*/


/*==================================================================================================
                                             ENUMS
==================================================================================================*/


/*==================================================================================================
                                 STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
                                 GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/

#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_MAGICCARPET_H */

/** @} */
